#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>
#include <stdlib.h>
//while 可以不用限定執行的次數
int main(void)
{
	int i, sum;
	i = 0, sum = 0;
	while (sum <= 100)
	{
		sum += i;
		printf("從0累加到%d = %d\n", i, sum);
		i++;
	}
	printf("從0累加，必須要加到%d才會超過100\n", i - 1);
	// i-1 因為當累加到i=14時得到105>100，接著下一行i++使i=15，回到while，此時sum=105,不執行，所以i多了1次
	return 0;
}

//從0累加到0 = 0
//從0累加到1 = 1
//從0累加到2 = 3
//從0累加到3 = 6
//從0累加到4 = 10
//從0累加到5 = 15
//從0累加到6 = 21
//從0累加到7 = 28
//從0累加到8 = 36
//從0累加到9 = 45
//從0累加到10 = 55
//從0累加到11 = 66
//從0累加到12 = 78
//從0累加到13 = 91
//從0累加到14 = 105
//從0累加，必須要加到14才會超過100